In [1]:
import pandas as pd
from datetime import datetime
import numpy as np

import matplotlib
import matplotlib.pyplot as plt

import statsmodels.api as sm
import statsmodels.formula.api as smf

from pylab import rcParams


# Importar a tabela de dados

df = pd.read_excel(r"Forecasting_FInal_Sales.xlsx")
display(df)

        Invdate  Qty  total_sales     mean_date
0    2016-05-02    3     68206.80  22735.600000
1    2016-05-03    1     15961.90  15961.900000
2    2016-05-07    2     60523.40  30261.700000
3    2016-05-10    4    140950.95  35237.737500
4    2016-05-11    3     39251.12  13083.706667
...         ...  ...          ...           ...
1292 2022-03-22    6    217071.23  36178.538333
1293 2022-03-23    4     91889.25  22972.312500
1294 2022-03-25    4     78806.76  19701.690000
1295 2022-03-28    4     71239.56  17809.890000
1296 2022-03-29    6     59578.91   9929.818333

[1297 rows x 4 columns]

In [2]:
df.columns

Index(['Invdate', 'Qty', 'total_sales', 'mean_date'], dtype='object')

In [3]:
df.value_counts() #contabiliza cada coluna

Invdate     Qty  total_sales  mean_date
2016-05-02  3    68206.80     22735.600000    1
2020-03-07  1    11610.06     11610.060000    1
2020-04-10  1    6388.80      6388.800000     1
2020-04-09  1    7463.61      7463.610000     1
2020-04-08  8    80172.64     10021.580000    1
                                             ..
2018-05-10  1    13998.40     13998.400000    1
2018-05-09  2    13996.12     6998.060000     1
2018-05-08  9    88236.57     9804.063333     1
2018-05-07  6    159045.69    26507.615000    1
2022-03-29  6    59578.91     9929.818333     1
Length: 1297, dtype: int64

In [4]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1292    False
1293    False
1294    False
1295    False
1296    False
Length: 1297, dtype: bool

In [5]:
df.duplicated().sum()

0

In [6]:
# Deletar as colunas q nao necessarias p/ facilitar o trabalho/visualizacao ("5S dos dados")


new_tab = df.drop(["Qty", "mean_date"], axis = 1) 
display(new_tab)

        Invdate  total_sales
0    2016-05-02     68206.80
1    2016-05-03     15961.90
2    2016-05-07     60523.40
3    2016-05-10    140950.95
4    2016-05-11     39251.12
...         ...          ...
1292 2022-03-22    217071.23
1293 2022-03-23     91889.25
1294 2022-03-25     78806.76
1295 2022-03-28     71239.56
1296 2022-03-29     59578.91

[1297 rows x 2 columns]

In [7]:
#Identificando o tipo de variavel para melhor entendimento dos dados

new_tab.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1297 entries, 0 to 1296
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Invdate      1297 non-null   datetime64[ns]
 1   total_sales  1297 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 20.4 KB

In [8]:
new_tab.set_index("Invdate",inplace=True)
#axis_x = new_tab.get_index()
new_tab

            total_sales
Invdate
2016-05-02     68206.80
2016-05-03     15961.90
2016-05-07     60523.40
2016-05-10    140950.95
2016-05-11     39251.12
...                 ...
2022-03-22    217071.23
2022-03-23     91889.25
2022-03-25     78806.76
2022-03-28     71239.56
2022-03-29     59578.91

[1297 rows x 1 columns]

In [9]:
# Inplace mostrara agora como DatetimeIndex AS IS (Periodo:2016-05-02 to 2022-03-29) e antes era RangeIndex (acima).

new_tab.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1297 entries, 2016-05-02 to 2022-03-29
Data columns (total 1 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   total_sales  1297 non-null   float64
dtypes: float64(1)
memory usage: 20.3 KB

In [10]:
#Calculando a media das vendas de cada mes e agrupando por ano

#means = round(new_tab.groupby([(new_tab.index.year), (new_tab.index.month)]).mean())
#display(means)

In [11]:
#Visualizando os meses (eixo x index) e os anos
index = means.index
print(index)

NameError: name 'means' is not defined

In [ ]:
#Calculando a estatistica descritiva baseada nas medias dos meses para o periodo de maio 2016 a marco 2022 = 71 dados
#Em media, as vendas medias foram de $108679 variando de $33419. Parecido com a mediana 50%, ou seja 50% das vendas medias
#foram menores que $101879 e 50% maiores que esse mesmo valor. O menor e o maior valores de venda media foram
# $52277,00 e $212947,00 respectivamente.

round(means.describe())

In [ ]:
#Percebe que para valores onde a media das vendas eh > 50% = $101879,00 as vendas variam mais de um mes p outro.
# quando comparado com os valores menores que 50%. Tb houveram 3 dias que as vendas medias foram bem expressivas (altas)

%matplotlib inline
plt.boxplot(means)

In [ ]:
#Construindo o grafico sequencial: pelo grafico de medias das vendas percebe-se um crescimento de vendas ao longo tempo
#208 & 2019 tiveram performances bem parecidas. Em 2020 houve uma venda media bem baixa (justificada pelo inicio da 
#pandemia) e chamando atencao para uma tendencia de crescimento nas vendas medias apos esse inicio.

means.plot(figsize=(20,7))

In [ ]:
import statsmodels.api as sm
#import statsmodels.formula.api as smf

from pylab import rcParams

rcParams["figure.figsize"] = 20, 7
decomposition = sm.tsa.seasonal_decompose(Invdate, model="aditive")
fig = decomposition.plot
plt.show()